app/controllers/api/messages_controller.rb

SELECT "chat_messages".* FROM "chat_messages"
---
  def all_messages
    render json: ChatMessage.all

INSERT INTO "chat_messages" ("email", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "test@test.com"], ["body", "hello"], ["created_at", "2017-07-19 18:00:26.668079"], ["updated_at", "2017-07-19 18:00:26.668079"]]
---
  def create
    message = ChatMessage.new(chat_message_params)
    if message.save